out/note/computer-science/morphogenesis/morphogenesis.org.html
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>note/computer-science/morphogenesis/morphogenesis.org</title>
</head>
<body>
<pre style="white-space: pre-wrap;">#+title: morphogenesis

* links

  - <a href="https://en.wikipedia.org/wiki/Morphogenesis">https://en.wikipedia.org/wiki/Morphogenesis</a>

* [note]

  - how to aford to exist?

  - how to respond to env?

  - how to encode informations about env into an organ?
    - taking early animal as examples
    - the principle of life, by tibor ganti
    - what is information?
      how is it different from matter and energy?
      theory about information should not only focus on transform.
      - informations about
        1. we can not do some dangerous things -- type system
        2. how to do some useful things -- procedural knowledge

  - how to hunt for solutions to survive better?
    - with recorded informations
</pre>
</body>
</html>
